Revit 2026 API

# ComboBoxMemberGroupName Property

---

The group to which the ComboBoxMember is assigned.

**Namespace:** Autodesk.Revit.UI**Assembly:** RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public string GroupName { get; }
```
```vb
Public ReadOnly Property GroupName As String
	Get
```
```cpp
public:
property String^ GroupName {
	String^ get ();
}
```
```fsharp
member GroupName : string with get
```

#### Property Value

String

If set, the ComboBoxMember appears under a group header in the ComboBox. If , the ComboBoxMember is not a member of any group. The default value is .

#### Reference

ComboBoxMember Class

Autodesk.Revit.UI Namespace